app/controllers/bump_list_controller.rb

	def list
		puts "params[:id]"
		params[:start_day] ||= 0
		params[:end_day] ||= params[:start_day]
		@list = Ranked.find_all_by_day(params[:start_day]..params[:end_day], :order => "item_name ASC, day ASC")
---
SELECT * FROM "ranked" WHERE ("ranked"."day" BETWEEN '0' AND '1') ORDER BY item_name ASC, day ASC